/*
P老师需要去商店买n支铅笔作为小朋友们参加NOIP的礼物。她发现商店一共有
33种包装的铅笔，不同包装内的铅笔数量有可能不同，价格也有可能不同。为
了公平起 见，P老师决定只买同一种包装的铅笔。商店不允许将铅笔的包装拆
开，因此P老师可能需要购买超过nn支铅笔才够给小朋 友们发礼物。现在P老师
想知道，在商店每种包装的数量都足够的情况下，要买够至少nn支铅笔最少需
花费多少钱。

输入格式
第一行包含一个正整数nn，表示需要的铅笔数量。

接下来三行，每行用2个正整数描述一种包装的铅笔：
其中第1个整数表示这种 包装内铅笔的数量，第2个整数表示这种包装的价格。

保证所有的77个数都是不超过1000010000的正整数。

输出格式
1个整数，表示P老师最少需要花费的钱。
*/

#include<stdio.h>
int main()
{
	int n;
	int n_1, n_2, n_3;
	int p_1, p_2, p_3;
	int e_1, e_2, e_3;
	int ans;
	scanf("%d %d %d %d %d %d %d", &n, &n_1, &p_1, &n_2, &p_2, &n_3, &p_3);
	//case1
	if (n <= n_1)
	{
		e_1 = p_1;
	}
	else if (n > n_1&&n%n_1 == 0)
	{
		e_1 = (n / n_1)*p_1;
	}
	else if (n > n_1&&n%n_1 != 0)
	{
		e_1 = (n / n_1)*p_1 + p_1;
	}
	//case2
	if (n <= n_2)
	{
		e_2 = p_2;
	}
	else if (n > n_2&&n%n_2 == 0)
	{
		e_2 = (n / n_2)*p_2;
	}
	else if (n > n_2&&n%n_2 != 0)
	{
		e_2 = (n / n_2)*p_2 + p_2;
	}
	//case3
	if (n <= n_3)
	{
		e_3 = p_3;
	}
	else if (n > n_3&&n%n_3 == 0)
	{
		e_3 = (n / n_3)*p_3;
	}
	else if (n > n_3&&n%n_3 != 0)
	{
		e_3 = (n / n_3)*p_3 + p_3;
	}

	if (e_1 < e_2&&e_1 < e_3)
	{
		ans = e_1;
	}
	if (e_2 < e_1&&e_2 < e_3)
	{
		ans = e_2;
	}
	if (e_3 < e_1&&e_3 < e_2)
	{
		ans = e_3;
	}
	printf("%d", ans);
	return 0;
}